In [1]:
import pandas as pd

In [2]:
df_1 = pd.read_csv('../data/bank/kaggle_financial_payment_1.csv')
df_2 = pd.read_csv('../data/bank/kaggle_financial_payment_2.csv')

In [3]:
df_1.head()

,step,customer,age,gender,zipcodeOri,merchant,zipMerchant,category,amount,fraud
0,0,'C1093826151','4','M','28007','M348934600','28007','es_transportation',4.55,0
1,0,'C352968107','2','M','28007','M348934600','28007','es_transportation',39.68,0
2,0,'C2054744914','4','F','28007','M1823072687','28007','es_transportation',26.89,0
3,0,'C1760612790','3','M','28007','M348934600','28007','es_transportation',17.25,0
4,0,'C757503768','5','M','28007','M348934600','28007','es_transportation',35.72,0

In [4]:
columns_to_drop = ["step", "age", "gender", "zipcodeOri", "merchant", "zipMerchant", "category", "amount", "zipcodeOri"]
df_1b = df_1.drop(columns=columns_to_drop)
df_1b.head()

        customer  fraud
0  'C1093826151'      0
1   'C352968107'      0
2  'C2054744914'      0
3  'C1760612790'      0
4   'C757503768'      0

In [5]:
df_1b['non_fraud'] = 0
df_1b.loc[df_1['fraud']==0, 'non_fraud'] = 1
df_1b.head()

        customer  fraud  non_fraud
0  'C1093826151'      0          1
1   'C352968107'      0          1
2  'C2054744914'      0          1
3  'C1760612790'      0          1
4   'C757503768'      0          1

In [6]:
columns_to_drop = ["customer"]
df_1c = df_1b.drop(columns=columns_to_drop)
df_1c.head()

   fraud  non_fraud
0      0          1
1      0          1
2      0          1
3      0          1
4      0          1

In [7]:
import matplotlib.pyplot as plt
#df_1c.plot.pie(subplots=True, figsize=(4, 4))